Обработки/Reports/_РегистрМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РегистрМНО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РегистрМНО/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Регистр по начислению процентного дохода на неснижаемый остаток",
		"0.13",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СформироватьОтчет(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаОкончания)));
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция ВыполнитьЗапрос()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваМНО.МНО КАК МНО,
	|	ДенежныеСредстваМНО.РасчетныйСчет.Банк КАК Банк,
	|	ДенежныеСредстваМНО.Сумма КАК Сумма,
	|	ДенежныеСредстваМНО.РасчетныйСчет.Валюта КАК Валюта,
	|	НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) КАК ДатаРазмещения,
	|	ДенежныеСредстваМНО.МНО.ДатаВозврата КАК ДатаВозврата,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА ДенежныеСредстваМНО.МНО.ДатаВозврата
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|	КОНЕЦ КАК ДатаОкончания,
	|	ДенежныеСредстваМНО.МНО.Процент КАК Процент,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) >= &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) >= &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата > НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), &КонецПериода, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоПериода, ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата > НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), &КонецПериода, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Дни
	|ПОМЕСТИТЬ _ДокМНО
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваМНО КАК ДенежныеСредстваМНО
	|ГДЕ
	|	ДенежныеСредстваМНО.Организация = &Организация
	|	И ДенежныеСредстваМНО.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) <= &КонецПериода
	|	И ДенежныеСредстваМНО.МНО.ДатаВозврата >= &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваМНО.МНО,
	|	ДенежныеСредстваМНО.РасчетныйСчет.Банк,
	|	ДенежныеСредстваМНО.Сумма,
	|	ДенежныеСредстваМНО.РасчетныйСчет.Валюта,
	|	НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ),
	|	ДенежныеСредстваМНО.МНО.Процент,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) >= &НачалоПериода
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < &НачалоПериода
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоПериода, ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) >= &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) >= &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата > НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), &КонецПериода, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоПериода, ДенежныеСредстваМНО.МНО.ДатаВозврата, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ) < &НачалоПериода
	|				И ДенежныеСредстваМНО.МНО.ДатаВозврата > НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.МНО.Дата, ДЕНЬ), &КонецПериода, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваМНО.МНО.ДатаВозврата <= НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ТОГДА ДенежныеСредстваМНО.МНО.ДатаВозврата
	|		ИНАЧЕ &КонецПериода
	|	КОНЕЦ,
	|	ДенежныеСредстваМНО.МНО.ДатаВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОстаткиИОбороты.Субконто1 КАК МНО,
	|	НалоговыйУчетОстаткиИОбороты.СуммаНачальныйОстаток КАК НачисленоНаНачалоПериода,
	|	НалоговыйУчетОстаткиИОбороты.СуммаОборотДт КАК НачисленоЗаПериод,
	|	НалоговыйУчетОстаткиИОбороты.СуммаОборотКт КАК ПолученоЗаПериод
	|ПОМЕСТИТЬ _Начисления
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НалоговыйУчетОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДокМНО.МНО КАК МНО,
	|	_ДокМНО.Банк КАК Банк,
	|	_ДокМНО.Сумма КАК Сумма,
	|	_ДокМНО.Валюта КАК Валюта,
	|	_ДокМНО.ДатаРазмещения КАК ДатаРазмещения,
	|	_ДокМНО.ДатаВозврата КАК ДатаВозврата,
	|	_ДокМНО.ДатаОкончания КАК ДатаОкончания,
	|	_ДокМНО.Процент КАК Процент,
	|	_ДокМНО.Дни КАК Дни,
	|	ЕСТЬNULL(_Начисления.ПолученоЗаПериод, 0) КАК Кол9,
	|	0 КАК Кол10,
	|	ЕСТЬNULL(_Начисления.НачисленоНаНачалоПериода, 0) + ЕСТЬNULL(_Начисления.НачисленоЗаПериод, 0) КАК Кол11,
	|	ЕСТЬNULL(_Начисления.НачисленоНаНачалоПериода, 0) КАК Кол12,
	|	ЕСТЬNULL(_Начисления.НачисленоЗаПериод, 0) КАК Кол13,
	|	ЕСТЬNULL(_Начисления.НачисленоНаНачалоПериода, 0) + ЕСТЬNULL(_Начисления.НачисленоЗаПериод, 0) - ЕСТЬNULL(_Начисления.ПолученоЗаПериод, 0) КАК Кол14
	|ИЗ
	|	_ДокМНО КАК _ДокМНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Начисления КАК _Начисления
	|		ПО _ДокМНО.МНО = _Начисления.МНО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРазмещения
	|ИТОГИ
	|	СУММА(Кол9),
	|	СУММА(Кол10),
	|	СУММА(Кол11),
	|	СУММА(Кол12),
	|	СУММА(Кол13),
	|	СУММА(Кол14)
	|ПО
	|	ОБЩИЕ";
	
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
//	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	

Процедура СформироватьОтчет(ДокументРезультат)	Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Отчет");	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Стр");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	РезультатЗапроса = ВыполнитьЗапрос();
	
	//шапка
	ПараметрыШапки = ПолучитьПараметрыШапки();

	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора	= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ДатаОкончания = Формат(ЭтотОбъект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(НачалоМесяца(ЭтотОбъект.Период.ДатаНачала), КонецМесяца(ЭтотОбъект.Период.ДатаОкончания), "ФП=Истина");			
	ДокументРезультат.Вывести(ОбластьШапка);
		
	Выборка= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл // итог
		ВыборкаСделка = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаСделка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаСделка);
			ДокументРезультат.Вывести(ОбластьСтрока);	
		КонецЦикла;	
		
		//итог 
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьИтог);
	
	КонецЦикла;	
	
	//подписи
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
